Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡོངས་སུ་སྤྱད་པར་བྱའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་།
en: They should refine the sense fields, the sensory elements, and the links of dependent origination.

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་སྤྱད་པར་བྱའོ།
en: They should refine the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་སྦྱང་བ་བྱའོ།
en: They should refine [the spiritual goals], up to and including all-aspect omniscience.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྦྱོང་བ་ཡིན།
en: Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, when bodhisattva great beings practice the six perfections, how do they refine the path to enlightenment?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ། ཤ་ར་དྭ་ཏིའི་བུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་པ་ཡང་ཡོད། འཇིག་རྟེན་ལས་འདས་པ་ཡང་ཡོད།
en: Venerable Śāradvatīputra,” replied Subhūti, “the perfection of generosity is both mundane and supramundane.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་པ་ཡང་ཡོད། འཇིག་རྟེན་ལས་འདས་པ་ཡང་ཡོད་དོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are both mundane and supramundane.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གང་འཇིག་རྟེན་ལས་འདས་པ་ནི་གང་། རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་བྱེད་ཅིང་། སྦྱིན་བདག་ཏུ་གྱུར་པ་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་།
en: Venerable Subhūti, what is the mundane perfection of generosity?

source: ཕོངས་པ་དང་།
en: What is the supramundane perfection of generosity?” “

source: ལྟོགས་པ་དང་། འདྲོན་པ་དང་། སློང་བ་ཟས་འདོད་པ་ལ་ནི་ཟས་སྐོམ་དང་། ཐེག་པ་དང་གོས་དང་། མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་གནས་དང་མལ་སྟན་དང་ཡོ་བྱད་དང་སྨན་དང་མིའི་ཡོ་བྱད་གཞན་གང་ཅི་ཡང་རུང་བའི་བར་དུ།
en: Venerable Śāradvatīputra,” replied Subhūti, “in this context, bodhisattva great beings practice generosity and, having become liberal donors, they offer food, drink, vehicles, clothing, flowers, garlands, incense, unguents, lodging, bedding, mats, utensils, medicines, and whatever other resources humans might need to virtuous ascetics, brahmin priests, the destitute, the starving, travelers, and to beggars who are in need of food [and so forth]. {

source: ཡོངས་སུ་གཏོང་སྟེ།
en: Dt.264} They offer their sons to those in need of sons.

source: བུ་ཕོ་འདོད་པ་ལ་ནི་བུ་ཕོ་ཡོངས་སུ་གཏོང་བུ་མོ་འདོད་པ་ལ་ནི་བུ་མོ།
en: They offer their daughters to those in need of daughters.

source: ཆུང་མ་འདོད་པ་ལ་ནི་ཆུང་མ།
en: They offer their wives to those in need of wives.

source: རྒྱལ་སྲིད་འདོད་པ་ལ་ནི་རྒྱལ་སྲིད།
en: They offer the kingdom to those in need of kingdoms.

source: མགོ་འདོད་པ་ལ་ནི་མགོ།
en: They offer their heads to those in need of heads.

source: ཡན་ལག་དང་ཉིང་ལག་འདོད་པ་ལ་ནི་ཡན་ལག་དང་ཉིང་ལག །
en: They offer their limbs and appendages to those in need of limbs and appendages.

source: ཤ་དང་ཁྲག་དང་རྐང་འདོད་པ་ལ་ནི་ཤ་དང་ཁྲག་དང་རྐང་ཡོངས་སུ་གཏོང་སྟེ།
en: They offer their flesh, blood, and marrow to those in need of flesh, blood, and marrow.

source: དེ་ཡང་གནས་ཤིང་ཡོངས་སུ་གཏོང་ལ། དེ་འདི་སྙམ་དུ་བདག་ནི་ཡོངས་སུ་གཏོང་བའོ།
en: In doing so, they practice liberality while adhering to their supports, thinking, ‘I am giving.

source: །འདི་ནི་ལེན་པའོ།
en: They are receiving.

source: །འདི་ནི་སྦྱིན་པའོ།
en: This is generosity.

source: །བདག་ནི་སེར་སྣ་མེད་པའོ།
en: I am without miserliness.

source: །བདག་ནི་སྦྱིན་པའི་བདག་པོའོ།
en: I am a donor.

source: །བདག་ནི་བདོག་པ་ཐམས་ཅད་གཏོང་བའོ།
en: I give everything.

source: །བདག་ནི་སངས་རྒྱས་ཀྱི་བཀའ་བཞིན་དུ་བྱེད་པའོ།
en: I obey the lord buddhas.

source: །བདག་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའོ་ཞེས་ཟེར་ཏེ་སྦྱིན་པ་དེ་བྱིན་ནས་ཀྱང་དམིགས་པའི་ཚུལ་གྱིས། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོ་ཞིང་།
en: I practice the perfection of generosity.’ Having given these gifts, they then dedicate them by way of apprehending, saying, ‘I dedicate these for the sake of unsurpassed, complete enlightenment, making common cause with all beings!

source: བདག་གི་སྦྱིན་པའི་འབྲས་བུ་འདིས་སེམས་ཅན་འདི་དག་ཚེ་འདི་ཉིད་ལ་བདེ་བ་དང་ཉེ་བར་ལེན་པ་མེད་པར།
en: Through this, the fruit of my gift, may these beings attain happiness in this lifetime!

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་བསྔོ་སྟེ།
en: May they attain final nirvāṇa, where is no residue of the psycho-physical aggregates!’

source: དེ་ཆགས་པ་གསུམ་ལ་ཆགས་ཤིང་། སྦྱིན་པ་དེ་ཡོངས་སུ་གཏོང་ངོ་།
en: However, in giving these gifts, they are tied by three fetters.

source: །གསུམ་གང་ཞེ་ན།
en: What, you may ask, are the three?

source: འདི་ལྟར་བདག་དུ་འདུ་ཤེས་པ་དང་གཞན་དུ་འདུ་ཤེས་པ་དང་སྦྱིན་པར་འདུ་ཤེས་པ་འདི་གསུམ་ལ་ཆགས་ནས།
en: They comprise the notion of self, the notion of others, and the notion of the act of giving.

source: སྦྱིན་པ་དེ་དག་ཡོངས་སུ་གཏོང་སྟེ། འདི་ནི་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: This act of giving gifts, when tied by these three fetters, is called the mundane perfection of generosity.

source: །ཅིའི་ཕྱིར་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་ཞེ་ན།
en: If you ask why it is called the mundane perfection of generosity, it is because it does not move beyond, sublimate, or transcend the mundane.

source: དེ་ནི་འདི་ལྟར་འཇིག་རྟེན་ལས་མི་གཡོ་མི་འཕགས་མི་འདའ་བས་དེའི་ཕྱིར་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: For that reason, it is designated as the mundane perfection of generosity. “

source: །དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the supramundane perfection of generosity?

source: འདི་ལྟར་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་སྟེ།
en: It is the purity of the three spheres.

source: དེ་ལ་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་གཏོང་བའི་ཚེ།
en: If you ask what is the purity of the three spheres, in this context, Venerable Śāradvatīputra, when bodhisattva great beings offer gifts, they do not apprehend a self, they do not apprehend a recipient, and they do not apprehend a giving.

source: བདག་མི་དམིགས་ལེན་པ་མི་དམིགས་སྦྱིན་པ་མི་དམིགས་རྣམ་པར་སྨིན་པ་ལ་ཡང་དགའ་བར་མི་བྱེད་པ་སྟེ།
en: They do not even rejoice in the ripening impact of their generosity.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཁོར་གསུམ་ཡོངས་སུ་དག་པའོ།
en: Śāradvatīputra, this is called bodhisattva great beings’ purity of the three spheres. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་། སྦྱིན་པ་དེ་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་སྟེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings offer gifts, and they offer those gifts to all beings.

source: སེམས་ཅན་དེ་དག་ཀྱང་མི་དམིགས་པར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོ་ཞིང་། མཚན་མ་ཅུང་ཟད་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་འདི་ནི།
en: Without apprehending those beings, they make their dedication for the sake of unsurpassed, complete enlightenment, but they do not observe even the slightest indication of anything. {

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Dt.265} This, Venerable Śāradvatīputra, is called the supramundane perfection of generosity.

source: །ཅིའི་ཕྱིར་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་ཞེ་ན། དེ་ནི་འདི་ལྟར་འཇིག་རྟེན་ལས་གཡོ་ཞིང་འཕགས་ལ་འདའ་བས།
en: If you ask why it is called the supramundane perfection of generosity, it is because it moves beyond the mundane, it is superior to the mundane, and it transcends the mundane.

source: དེའི་ཕྱིར་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: For that reason, it is called the supramundane perfection of generosity. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་པ་ཡང་ཡོད།
en: Venerable Śāradvatīputra, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are both mundane and supramundane. “

source: འཇིག་རྟེན་ལས་འདས་པ་ཡང་ཡོད་དེ། དེ་ལ་འཇིག་རྟེན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the mundane perfection of ethical discipline?

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་སྲུང་ཞིང་། དེ་ཡང་གནས་པས་སྲུང་སྟེ། དེ་འདི་སྙམ་དུ་བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: In this context, Venerable Śāradvatīputra, bodhisattva great beings maintain ethical discipline, and do so by adhering to supports, thinking, ‘I maintain ethical discipline for the sake of all beings.

source: །འདི་ནི་ཚུལ་ཁྲིམས་སོ།
en: This is ethical discipline.

source: །བདག་ནི་སངས་རྒྱས་ཀྱི་བཀའ་བཞིན་བྱེད་དོ།
en: I obey the buddhas.’

source: །ཞེས་བྱ་བ་ནས་དེ་འདི་ལྟར་བདག་ཏུ་འདུ་ཤེས་པ་དང་། གཞན་དུ་འདུ་ཤེས་པ་དང་ཚུལ་ཁྲིམས་སུ་འདུ་ཤེས་པ་དང་། ཆགས་པ་འདི་དག་གསུམ་ཞེས་བྱ་བའི་བར་ལ་ཆགས་ཤིང་། ཚུལ་ཁྲིམས་སྲུང་སྟེ།
en: So saying, they maintain ethical discipline and are attached to three fetters comprising the notion of self, the notion of others, and the notion of ethical discipline.

source: འདི་ནི་འཇིག་རྟེན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: This is called the mundane perfection of ethical discipline.

source: །དེ་ཅིའི་ཕྱིར་འཇིག་རྟེན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་ཞེ་ན། དེ་ནི་འདི་ལྟར་འཇིག་རྟེན་ལས་མི་གཡོ་མི་འཕགས་མི་འདའ་བས།
en: If you ask why it is called the mundane perfection of ethical discipline, it is because it does not move beyond, sublimate, or transcend the mundane.

source: དེའི་ཕྱིར་འཇིག་རྟེན་པ་ཞེས་བྱའོ།
en: For that reason, it is said to be mundane. “

source: །དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the supramundane perfection of ethical discipline?

source: དེ་ལ་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་སྲུང་བའི་ཚེ། བདག་མི་དམིགས་སེམས་ཅན་མི་དམིགས། ཚུལ་ཁྲིམས་མི་དམིགས།
en: If you ask what is the purity of the three spheres, in this context, Venerable Śāradvatīputra, when bodhisattva great beings maintain ethical discipline, they do not apprehend the self, they do not apprehend beings, and they do not apprehend ethical discipline.

source: རྣམ་པར་སྨིན་པ་ལ་ཡང་དགའ་བར་མི་བྱེད་ཅིང་། ཚུལ་ཁྲིམས་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་སྟེ།
en: They do not even rejoice in the ripening impact of their ethical discipline and they offer it on behalf of all beings.

source: སེམས་ཅན་དེ་དག་ཀྱང་མི་དམིགས་པར་བླ་ན་མེད་པར་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོ་ཞིང་། མཚན་མ་ཅུང་ཟད་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་འདི་ནི།
en: Without apprehending those beings, they make their dedication for the sake of unsurpassed, complete enlightenment, and they do not observe even the slightest indication [of anything].

source: འཇིག་རྟེན་ལས་འདས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ།
en: This is called the supramundane perfection of ethical discipline.

source: དེ་ནི་འདི་ལྟར་འཇིག་རྟེན་ལས་གཡོ་ཞིང་འཕགས་ལ་འདའ་བས། དེའི་ཕྱིར་འཇིག་རྟེན་ལས་འདས་པ་ཞེས་བྱའོ།
en: It is said to be supramundane because it does move beyond, sublimate, and transcend the mundane. “

source: །དེ་ལ་འཇིག་རྟེན་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the mundane perfection of tolerance?

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་སྒོམ་ཞིང་། དེ་ཡང་གནས་པས་སྒོམ་སྟེ། དེ་འདི་སྙམ་དུ་བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བཟོད་པ་བསྒོམ་མོ།
en: In this context, Venerable Śāradvatīputra, bodhisattva great beings cultivate tolerance, and do so by adhering to supports, thinking, ‘I am cultivating tolerance for the sake of all beings.

source: །འདི་ནི་བཟོད་པའོ།
en: This is tolerance.

source: །ཞེས་བྱ་བ་ནས་དེ་འདི་ལྟར་བདག་དུ་འདུ་ཤེས་པ་དང་། གཞན་དུ་འདུ་ཤེས་པ་དང་། བཟོད་པར་འདུ་ཤེས་པ་དང་། ཆགས་པ་འདི་གསུམ་ཞེས་བྱ་བའི་བར་ལ་ཆགས་ཤིང་བཟོད་པ་སྒོམ་སྟེ།
en: So saying, they cultivate tolerance and are attached to three fetters comprising the notion of self, the notion of others, and the notion of tolerance.

source: འདི་ནི་འཇིག་རྟེན་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: This is called the mundane perfection of tolerance.

source: །དེ་ཅིའི་ཕྱིར་འཇིག་རྟེན་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་ཞེ་ན། དེ་ནི་འདི་ལྟར་འཇིག་རྟེན་ལས་མི་གཡོ་མི་འཕགས་མི་འདའ་བས།
en: If you ask why it is called the mundane perfection of tolerance, it is because it does not move beyond, sublimate, or transcend the mundane.

source: །དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the supramundane perfection of tolerance?

source: དེ་ལ་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པ་སྒོམ་པའི་ཚེ། བདག་མི་དམིགས་སེམས་ཅན་མི་དམིགས་བཟོད་པ་མི་དམིགས།
en: If you ask what is the purity of the three spheres, in this context, Venerable Śāradvatīputra, when bodhisattva great beings cultivate tolerance, they do not apprehend the self, they do not apprehend beings, and they do not apprehend tolerance.

source: རྣམ་པར་སྨིན་པ་ལ་ཡང་དགའ་བར་མི་བྱེད་ཅིང་། བཟོད་པ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་སྟེ།
en: They do not even rejoice in the ripening impact of their tolerance and they offer it on behalf of all beings.

source: སེམས་ཅན་དེ་དག་ཀྱང་མི་དམིགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོ་ཞིང་། མཚན་མ་ཅུང་ཟད་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་འདི་ནི།
en: Without apprehending those beings, they make their dedication for the sake of unsurpassed, complete enlightenment, and they do not observe even the slightest indication of anything.

source: འཇིག་རྟེན་ལས་འདས་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ།
en: This is called the supramundane perfection of tolerance.

source: །དེ་ལ་འཇིག་རྟེན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the mundane perfection of perseverance?

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་རྩོམ་ཞིང་། དེ་ཡང་གནས་པས་རྩོམ་སྟེ། དེ་འདི་སྙམ་དུ་བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བརྩོན་འགྲུས་རྩོམ་མོ།
en: In this context, Venerable Śāradvatīputra, bodhisattva great beings undertake perseverance, and do so by adhering to supports, thinking, ‘I am undertaking perseverance for the sake of all beings.

source: །འདི་ནི་ལུས་སོ། །འདི་ནི་སེམས་སོ།
en: This is the body. This is the mind.

source: །འདི་ནི་བརྩོན་འགྲུས་སོ།
en: This is perseverance.

source: །བདག་ནི་སངས་རྒྱས་ཀྱི་བཀའ་བཞིན་དུ་བྱེད་དོ།
en: I obey the buddhas.’

source: །ཞེས་བྱ་བ་ནས་དེ་འདི་ལྟར་བདག་ཏུ་འདུ་ཤེས་པ་དང་། གཞན་དུ་འདུ་ཤེས་པ་དང་། བརྩོན་འགྲུས་སུ་འདུ་ཤེས་པ་དང་། ཆགས་པ་འདི་གསུམ་ཞེས་བྱ་བའི་བར་ལ་ཆགས་ཤིང་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: So saying, they undertake perseverance and are attached to three fetters comprising the notion of self, the notion of others, and the notion of perseverance.

source: འདི་ནི་འཇིག་རྟེན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: This is called the mundane perfection of perseverance.

source: །དེ་ཅིའི་ཕྱིར་འཇིག་རྟེན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་ཞེ་ན། དེ་ནི་འདི་ལྟར་འཇིག་རྟེན་ལས་མི་གཡོ་མི་འཕགས་མི་འདའ་བས།
en: If you ask why it is called the mundane perfection of perseverance, it is because it does not move beyond, sublimate, or transcend the mundane.

source: །དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the supramundane perfection of perseverance?

source: དེ་ལ་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་རྩོམ་པའི་ཚེ། བདག་མི་དམིགས་སེམས་ཅན་མི་དམིགས་བརྩོན་འགྲུས་མི་དམིགས།
en: If you ask what is the purity of the three spheres, in this context, Venerable Śāradvatīputra, when bodhisattva great beings undertake perseverance, they do not apprehend the self, they do not apprehend beings, and they do not apprehend perseverance.

source: རྣམ་པར་སྨིན་པ་ལ་ཡང་དགའ་བར་མི་བྱེད་ཅིང་། བརྩོན་འགྲུས་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་སྟེ།
en: They do not even rejoice in the ripening impact of their perseverance and they offer it on behalf of all beings.

source: འཇིག་རྟེན་ལས་འདས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ།
en: This is called the supramundane perfection of perseverance.

source: །དེ་ལ་འཇིག་རྟེན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the mundane perfection of meditative concentration?

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་ཅིང་། དེ་ཡང་གནས་པས་སྙོམས་པར་འཇུག་སྟེ། དེ་འདི་སྙམ་དུ་བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་གོ །
en: In this context, Venerable Śāradvatīputra, bodhisattva great beings are absorbed in meditative concentration, and do so by adhering to supports, thinking, ‘I am absorbed in meditative concentration for the sake of all beings.

source: འདི་ནི་བསམ་གཏན་ནོ།
en: This is meditative concentration.

source: །ཞེས་བྱ་བ་ནས་དེ་འདི་ལྟར་བདག་དུ་འདུ་ཤེས་པ་དང་། གཞན་དུ་འདུ་ཤེས་པ་དང་། བསམ་གཏན་དུ་འདུ་ཤེས་པ་དང་། ཆགས་པ་འདི་གསུམ་ཞེས་བྱ་བའི་བར་ལ་ཆགས་ཤིང་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་སྟེ།
en: So saying, they are absorbed in meditative concentration and are attached to three fetters comprising the notion of self, the notion of others, and the notion of meditative concentration.

source: འདི་ནི་འཇིག་རྟེན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: This is called the mundane perfection of meditative concentration.

source: །དེ་ཅིའི་ཕྱིར་འཇིག་རྟེན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་ཞེ་ན། དེ་ནི་འདི་ལྟར་འཇིག་རྟེན་ལས་མི་གཡོ་མི་འཕགས་མི་འདའ་བས།
en: If you ask why it is called the mundane perfection of meditative concentration, it is because it does not move beyond, sublimate, or transcend the mundane.

source: །དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the supramundane perfection of meditative concentration?

source: དེ་ལ་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པའི་ཚེ་བདག་མི་དམིགས་སེམས་ཅན་མི་དམིགས་བསམ་གཏན་མི་དམིགས་རྣམ་པར་སྨིན་པ་ལ་ཡང་དགའ་བར་མི་བྱེད་དོ།
en: If you ask what is the purity of the three spheres, in this context, Venerable Śāradvatīputra, when bodhisattva great beings are absorbed in meditative concentration, they do not apprehend the self, they do not apprehend beings, and they do not apprehend meditative concentration.

source: །བསམ་གཏན་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་སྟེ།
en: They do not even rejoice in the ripening impact of their meditative concentration and they offer it on behalf of all beings.

source: འཇིག་རྟེན་ལས་འདས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ།
en: This is called the supramundane perfection of meditative concentration.

source: །དེ་ལ་འཇིག་རྟེན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: What, you may ask, is the mundane perfection of wisdom?

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་སྒོམ་ཞིང་། དེ་ཡང་གནས་པས་སྒོམ་སྟེ། དེ་འདི་སྙམ་དུ་བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཤེས་རབ་སྒོམ་མོ།
en: In this context, Venerable Śāradvatīputra, bodhisattva great beings cultivate wisdom, and do so by adhering to supports, thinking, ‘I am cultivating wisdom for the sake of all beings.

source: །འདི་ནི་ཤེས་རབ་བོ།
en: This is wisdom.

source: །བདག་ནི་སངས་རྒྱས་ཀྱི་བཀའ་བཞིན་བྱེད་དོ་ཞེས་བྱ་བ་ནས།
en: I obey the buddhas.’

source: དེ་འདི་ལྟར་བདག་ཏུ་འདུ་ཤེས་པ་དང་། གཞན་དུ་འདུ་ཤེས་པ་དང་། ཤེས་རབ་ཏུ་འདུ་ཤེས་པ་དང་། ཆགས་པ་འདི་གསུམ་ཞེས་བྱ་བའི་བར་ལ་ཆགས་ཤིང་། ཤེས་རབ་སྒོམ་སྟེ།
en: So saying, they cultivate wisdom and are attached to three fetters comprising the notion of self, the notion of others, and the notion of wisdom.

source: འདི་ནི་འཇིག་རྟེན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: This is called the mundane perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་འཇིག་རྟེན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་ཞེ་ན། དེ་ནི་འདི་ལྟར་འཇིག་རྟེན་ལས་མི་གཡོ་མི་འཕགས་མི་འདའ་བས།
en: If you ask why it is called the mundane perfection of wisdom, it is because it does not move beyond, sublimate, or transcend the mundane.

source: དེའི་ཕྱིར་འཇིག་རྟེན་པ་ཞེས་བྱའོ། །དེ་ལ་འཇིག་རྟེན་ལས་འདས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེ་ན།
en: For that reason, it is said to be mundane.{Dt.266} “What, you may ask, is the supramundane perfection of wisdom?

source: དེ་ལ་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་པའི་ཚེ། བདག་མི་དམིགས་སེམས་ཅན་མི་དམིགས། ཤེས་རབ་མི་དམིགས།
en: If you ask what is the purity of the three spheres, in this context, Venerable Śāradvatīputra, when bodhisattva great beings cultivate the perfection of wisdom, they do not apprehend the self, they do not apprehend beings, and they do not apprehend wisdom.

source: རྣམ་པར་སྨིན་པ་ལ་ཡང་དགའ་བར་མི་བྱེད་ཅིང་། ཤེས་རབ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་སྟེ།
en: They do not even rejoice in the ripening impact of their wisdom and they offer it on behalf of all beings.

source: འཇིག་རྟེན་ལས་འདས་པའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་སྟེ།
en: This is called the supramundane perfection of wisdom.

source: དེ་ནི་འདི་ལྟར། འཇིག་རྟེན་ལས་གཡོ་ཞིང་འཕགས་ལ་འདའ་བས། དེའི་ཕྱིར། འཇིག་རྟེན་ལས་འདས་པ་ཞེས་བྱའོ།
en: It is said to be supramundane because it does move beyond, sublimate, and transcend the mundane. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ཅིང་། བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྦྱོང་བ་ཡིན་ནོ། །སྨྲས་པ།
en: So it is, Venerable Śāradvatīputra, that bodhisattva great beings practice the six perfections and refine the path to enlightenment.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་གང་ཡིན།
en: Venerable Subhūti, what is the bodhisattva great beings’ path to enlightenment?” {

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ།
en: Dt.267} “Venerable Śāradvatīputra,” replied Subhūti, “the perfection of generosity constitutes the bodhisattva great beings’ path to enlightenment.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom constitute the bodhisattva great beings’ path to enlightenment. “
